{"username":" Ann Ramona &nbsp;","userimage":"A","revdate":"25-Nov-2018","revstar":5,"revtext":"I am 54, and just like most ladies my age, dealing with hair thinning and hair   loss.   My hair loss treatment is going on but I realised that it was going to take a   while before I get back my hair.   I wanted to have my hair back and I wanted it fast.   Someone suggested I use hair pieces or &lsquo;wigs&rsquo;. OMG thought I . . . how   terrible (I have seen quite a few people with badly fitted wigs and pathetic   hair pieces).   I was apprehensive.   I thought good wigs were frightfully expensive and only for movie stars who   could both afford to get them from abroad and maintain it as well !   What do I do to sport some hair on my head? I decided to check.   I browsed and browsed and also consulted my physician if using one could   have any adverse effects on my already falling hair.   Google showed me many options and after all that research for two months, it   boiled down to finding the right vendor.   I found &lsquo;Wigomania&rsquo; a UK based product vendor and met Aysha who knew   exactly what I needed.   With the ease of a professional, she had me fitted in no time, with something   that was both practical and perfect for my need.   I was impressed.   Wigomania not only had top of the line products with a variety to choose, from   a classy outlet, it had staff to match.   Their products are priced well and offer great value for money.   They also lend after sales assistance in washing or maintaining their products,   should we need them.   I bought what I needed and also something I wanted.   I thought &hellip;. after all we spend a lot more on lot less &hellip; this is MY CROWNING   GLORY so why not ! Thank you Aysha !  ","revreply":"  Hi Ann...Thank you so much for your kind words and appreciation.   It makes our objective to serve and make a difference in people's lives all the   more stronger and encourages us to keep going on doing the same thing each   day.   Your thoughts are a great motivator for our excellent team in Chennai - each of   them are brilliant in what they do and indeed Aysha heads it.   She is very special.  "}