{"username":"Vijaya Muralidharan &nbsp;","userimage":"V","revdate":"01-Feb-2018","revstar":5,"revtext":"Went with such a heavy heart that &mdash;--   I am losing my&mdash; the once before beautiful precious tress!   Met Aysha &mdash; who had an immediate solution with a crown topper ! &mdash; &mdash;   heaviness lifted slowly and steadily &mdash; as she started expaining and wore the   piece on my balding crown &mdash;   Immediate feeling as a newly CROWNED queen ! A jewel indeed &mdash; more than   an accessory&mdash;   Very natural human hair &mdash;   Can&rsquo;t thank Aysha enough &mdash; 5\/5&ndash; to you (though u gave me only 7\/10 for the   exam rhat u held for my self - help wearing !)   In cliched terms &mdash;   EXCELLENT SERVICE AND SATISFACTION GUARANTEED!   Thank you AYSHA ! !   And also Nishi and Jonah!   Thanks to the owner sir (forgot to ask his name )&mdash;who thought of this venture   in Chennai&mdash;   Kudos to your effort!   Kindly continue !   One small suggestion &mdash;   Make them a little more affordable &mdash; sir ,you know why?&mdash; i want to make   my closet as a miniature of your shop!  ","revreply":"  We are so honoured to receive such a lavish compliment from you.   Thrilled to know that our staff has offered you their best service, attention and   product that suits your requirement.   They are all trained to ensure that every person who walks into our Store is   offered the best quality of support, advise and suitable product.   We want to make a difference in people's lives and hence have opened our   own brand stores to ensure the service that befits a UK brand is offered   always.   Noted about the pricing.   While we promise and assure you of offering our products at the best possible   price you would appreciate that we have to maintain our quality and standard   to ensure the product we offer meets our client requirement and gives a long   term value too.   Having a closet of Wig-O-Mania is by far the bestest compliment we have   received to date. You hereby are granted a permanent 10% discount from us. :)  "}