{"username":" Preethi Rajasekaran &nbsp;","userimage":"P","revdate":"18-Mar-2019","revstar":5,"revtext":"Extraordinary Products and Excellent service rendered by Ayesha and her   team.   My mother is an Alopecia patient and she was very depressed due to her   complete hair loss, I urged her to use Wigs, since transplant is not possible for   her, she was very afraid of what would others talk about her, mainly people   surrounding us.   She was also very anxious about the price when she checked for Wigs online.   And she was not willing to attend any functions due to her complete hair loss.   No one knows how people will talk about you when you have hair fall or hair   loss and about a woman having a complete baldness.   My mother had the taste of everyone seeing her different and making   comments at her.   I took a drastic step for her and I googled for many options and at last I found   this place Wig- O- Mania, I immediately contacted Ayesha and she was very   prompt and she helped me in all times explaining me even small things about   Wigs, and to add she treats her customers as her family.   I took my mother to Wig- O - Mania, Chennai, she was very reluctant at first,   but when I introduced my mother to Ayesha, I knew that it was my best   decision in my life, Ayesha took care of her and fitted my mother with her best   product, to say frankly, my mother looked 10 years young.   She was flabbergasted and My mother was really happy to see herself with   complete hair after a long time. She loved the way she looked now and now   she is roaming happily around.   To add we got three wigs for her.   Their products are flawless and hand made, and impressive. It doesn't look like   artificial hair wig, it looks very natural as if it's our own hair. Completely   harmless And Budget Friendly too.   About their services, I'm totally more than happy, Ayesha is very friendly and   doesn't push her customers to buy her products and she being a professional   in this field, she explains and settles us with the best for us. She gives what you   ask for. She is the perfectionist I have ever seen who takes care of every   customers.   I thank wholeheartedly Ayesha and her team for making my mother smile   again, it means a lot to me and my family. You people are the best.   Keep reaching heights.   And my special thanks to Ayesha who made everything possible by her smile,   wishing you a best of all.   To precise about Wig - O - Mania ------ &quot;A MIRACLE &quot;  ","revreply":"  Hi Preethi. We are thrilled to receive such an overwhelming response from   you. It is an absolute honour and a humbling experience for all of us at Wig-O-   Mania for which we are ever so grateful to you. Making a difference in the life   of each and every person who walks through our doors in our sincere intention   and corporate CSR too. We are fully aware of the trauma that people with hair   loss issues suffer and we ensure that our staff offer the best advise and   recommend the ideal product. For us it is not selling but client satisfaction.   Aysha is our diamond and indeed a the miracle worker who motivates   everyone around her. We wish your mother the very best with long and   healthy life and God Bless you for being a perfect daughter.  "}