[{"Date":"25-Jan-2019","Name":" Prabu Krishnan &nbsp;","Content":"Wonder-O-Mania – Yes, Ayesha and Team is doing miracle in this industry. &nbsp; The base line is, they love people and care about their customers dearly to give &nbsp; best out of best to everyone. &nbsp; Ayesha is not convincing others&nbsp;of what she know, but convincing them&nbsp;of &nbsp; what they do not and truth. &nbsp; I had wonderful experience with this&nbsp;team,&nbsp;no one believe that I&nbsp;am&nbsp;using &nbsp; wig\/patch. &nbsp; I have received 100s of feedback&nbsp;from colleagues, relatives all just&nbsp;stunning. &nbsp; My son loved it :). &nbsp; Special mention to Stylist – Man you’re style Monster. Overall, Genuine &nbsp; Business…Genuine Advice… &nbsp; The Best Quality Products and Service Offered. &nbsp; Try to visit&nbsp;once&nbsp;direct&nbsp;to store to&nbsp;witness&nbsp;what I&nbsp;shared is less about&nbsp;their &nbsp; service. &nbsp;","ID":"Ch 38 ","Response":"&nbsp; Thank you&nbsp;so&nbsp;much&nbsp;for your glowing appreciation and kind words. It&nbsp;makes &nbsp; everything that we do all the more so much worth it. &nbsp; The motto&nbsp;of&nbsp;Wig-O-Mania&nbsp;(we will&nbsp;in&nbsp;future&nbsp;refer&nbsp;the&nbsp;title&nbsp;you&nbsp;have&nbsp;graciously &nbsp; bestowed upon us)&nbsp;is to&nbsp;make&nbsp;a difference&nbsp;in people's&nbsp;lives by&nbsp;offering&nbsp;since &nbsp; advise and an Instant solution. &nbsp; And when it&nbsp;is appreciated&nbsp;then it&nbsp;makes&nbsp;us all&nbsp;the&nbsp;more&nbsp;determined to&nbsp;work &nbsp; harder to ensure every client walks away with your thoughts. &nbsp; Best wishes to you and thanks once again &nbsp;"},{"Date":"22-Mar-2019","Name":" Shruti&nbsp;Upadhayay","Content":"Hey&nbsp;All,&nbsp;Ayesha being&nbsp;a&nbsp;great&nbsp;human&nbsp;being and&nbsp;doing &nbsp; superb job.. &nbsp; I luved the way she suggested us the&nbsp;product&nbsp;and hats&nbsp;off to&nbsp;her&nbsp;patience, &nbsp; product looks really natural..u get lot of confidence. &nbsp; Its really worth visiting the store and having the product.. &nbsp; Thanks Ayesha, keep it. All d best &nbsp;","ID":"Ch 46 ","Response":"&nbsp; We are honoured&nbsp;to&nbsp;receive&nbsp;your&nbsp;comments&nbsp;and&nbsp;thank you for&nbsp;taking&nbsp;the&nbsp;time &nbsp; to do it. &nbsp; As a brand&nbsp;we&nbsp;take pride if our&nbsp;craftsmanship&nbsp;and quality but&nbsp;more than&nbsp;that &nbsp; we are very&nbsp;proud of&nbsp;our&nbsp;team&nbsp;whose&nbsp;dedication&nbsp;and commitment&nbsp;to&nbsp;\"make&nbsp;a &nbsp; difference\" in people's lives. &nbsp; This is the motto of all of us at every level. &nbsp; Thank you once again for your blessings and best wishes. &nbsp;"},{"Date":"25-Oct-2018","Name":" Arun Kumar &nbsp;","Content":"Am really happy. Nice. Very nice.Good .. Super. &nbsp; I never seen such a good experience in Wig-O-Mania. &nbsp; I done hair replacement hear today... &nbsp; I love those assist me thank you. &nbsp; I gave 5 star &nbsp;","ID":"Ch 26 ","Response":"&nbsp; Thanks Arun Kumar for your review and appreciation. &nbsp; We at Wig-O-Mania endeavour&nbsp;to enhance&nbsp;end&nbsp;user&nbsp;experience&nbsp;with&nbsp;not&nbsp;only &nbsp; our exclusive range of products but also our service and sincere advice. &nbsp;"},{"Date":"25-Feb-2019","Name":" Jerome Jude Arokiaraj Jacob Selvaraj &nbsp;","Content":"Initially I was&nbsp;sceptical over Wig-O-Mania's&nbsp;products&nbsp;and&nbsp;whether&nbsp;it&nbsp;will&nbsp;really &nbsp; suit me.&nbsp;Finally&nbsp;when i&nbsp;decided&nbsp;to&nbsp;try it&nbsp;out and&nbsp;went&nbsp;to&nbsp;the&nbsp;shop, Ayisha&nbsp;and &nbsp; her team welcomed us though we were late for the appointment. &nbsp; She and her stylist stayed all the while until 9pm+ to fit the hair piece. I wanted &nbsp; to write this review few months are trying the product. &nbsp; It’s been&nbsp;more&nbsp;than&nbsp;3 months&nbsp;so&nbsp;I&nbsp;can&nbsp;very confidently&nbsp;say&nbsp;that&nbsp;their&nbsp;product&nbsp;is &nbsp; very genuine and really really good. &nbsp; My old friends whom i haven't seen for many years couldn't find any difference &nbsp; and all of&nbsp;my relatives and family gave&nbsp;a&nbsp;Big thumbs&nbsp;up for my new look&nbsp;!! &nbsp; Some couldn't&nbsp;even&nbsp;find that&nbsp;I am using&nbsp;hair&nbsp;piece so they&nbsp;asked me&nbsp;if I&nbsp;grew &nbsp; my hair naturally (ha ha). &nbsp; I am truly happy and I would strongly recommend this product to others. &nbsp; Once again I want to&nbsp;thank&nbsp;Ayisha&nbsp;and her&nbsp;team for&nbsp;their&nbsp;excellent service&nbsp;in &nbsp; this industry. &nbsp; I sincerely pray that they will be blessed and will multiply !! &nbsp;","ID":"Ch 42 ","Response":"&nbsp; We are honoured&nbsp;to&nbsp;receive&nbsp;your&nbsp;comments&nbsp;and&nbsp;thank you for&nbsp;taking&nbsp;the&nbsp;time &nbsp; to do it. &nbsp; As a brand&nbsp;we&nbsp;take pride if our&nbsp;craftsmanship and&nbsp;quality&nbsp;but&nbsp;more than&nbsp;that &nbsp; we are very&nbsp;proud of&nbsp;our&nbsp;team&nbsp;whose&nbsp;dedication&nbsp;and commitment&nbsp;to&nbsp;\"make&nbsp;a &nbsp; difference\" in people's lives. &nbsp; This is the motto&nbsp;of all of&nbsp;us&nbsp;at&nbsp;every level. Thank you once again for&nbsp;your &nbsp; blessings and best wishes. &nbsp;"},{"Date":"25-Dec-2018","Name":" Deepti Vernekar &nbsp;","Content":"Thank you Ayesha...the&nbsp;wig&nbsp;selection&nbsp;process&nbsp;was&nbsp;of&nbsp;great&nbsp;help&nbsp;&amp;&nbsp;the&nbsp;quality&nbsp;of &nbsp; wig is also as guaranteed great. &nbsp; I have been using it of past 15days &amp; find it very comfortable,&amp; most people do &nbsp; not get to know I am using a wig too..... &nbsp; thanks once again. &nbsp;","ID":"Ch 34 ","Response":"&nbsp; Thank you so much Deepti for your appreciation. &nbsp; We are thrilled to note that you have liked the product. &nbsp; We are aware that you&nbsp;are&nbsp;based&nbsp;out&nbsp;of Goa and&nbsp;Aysha&nbsp;had&nbsp;to&nbsp;explain&nbsp;to&nbsp;you &nbsp; via video calls and explain the product and also ensure you of the quality. &nbsp; I am glad&nbsp;we&nbsp;could&nbsp;gain your&nbsp;trust in&nbsp;us and helped you to&nbsp;decide. God&nbsp;Bless &nbsp; you. &nbsp;"},{"Date":"11-Mar-2019","Name":" prasanna leela &nbsp;","Content":"Hi this is leela..Wig-O-Mania is an instant solution for hairloss. &nbsp; There are&nbsp;many&nbsp;varieties&nbsp;of&nbsp;hairpieces&nbsp;are&nbsp;available in&nbsp;the&nbsp;store which&nbsp;is&nbsp;great &nbsp; value for money and Thank you Aysha for all your support. &nbsp;","ID":"Ch 43 ","Response":"&nbsp; Hi Leela...Thank you so much for your review and ratings. &nbsp; We are&nbsp;thrilled&nbsp;to&nbsp;note that we&nbsp;have&nbsp;made&nbsp;a&nbsp;difference in&nbsp;your&nbsp;life&nbsp;and&nbsp;hence &nbsp; deserved your rating and best wishes. &nbsp; Our team&nbsp;headed&nbsp;by Aysha&nbsp;does&nbsp;an&nbsp;excellent&nbsp;job&nbsp;to&nbsp;ensure&nbsp;every&nbsp;client&nbsp;is&nbsp;given &nbsp; her best attention, advise and product. &nbsp;"},{"Date":"18-Mar-2019","Name":" Preethi Rajasekaran &nbsp;","Content":"Extraordinary Products and Excellent service rendered by Ayesha and&nbsp;her &nbsp; team. &nbsp; My mother is an Alopecia patient and she was very depressed due to her &nbsp; complete hair&nbsp;loss,&nbsp;I urged&nbsp;her to&nbsp;use&nbsp;Wigs,&nbsp;since&nbsp;transplant is&nbsp;not&nbsp;possible&nbsp;for &nbsp; her, she was very&nbsp;afraid&nbsp;of&nbsp;what would others talk about her, mainly&nbsp;people &nbsp; surrounding us. &nbsp; She was also very anxious about the price when she checked for Wigs online. &nbsp; And she was not willing to attend any functions due to her complete hair loss. &nbsp; No one knows how people will talk&nbsp;about&nbsp;you&nbsp;when you have&nbsp;hair&nbsp;fall or&nbsp;hair &nbsp; loss and about a woman having a complete baldness. &nbsp; My mother had the taste of everyone seeing her different and making &nbsp; comments at her. &nbsp; I took&nbsp;a&nbsp;drastic&nbsp;step&nbsp;for&nbsp;her and&nbsp;I&nbsp;googled&nbsp;for&nbsp;many&nbsp;options&nbsp;and&nbsp;at&nbsp;last I&nbsp;found &nbsp; this place&nbsp;Wig- O-&nbsp;Mania,&nbsp;I immediately contacted&nbsp;Ayesha and she&nbsp;was&nbsp;very &nbsp; prompt and&nbsp;she&nbsp;helped&nbsp;me&nbsp;in&nbsp;all times&nbsp;explaining&nbsp;me&nbsp;even small&nbsp;things&nbsp;about &nbsp; Wigs, and to add she treats her customers as her family. &nbsp; I took my&nbsp;mother&nbsp;to Wig-&nbsp;O&nbsp;- Mania, Chennai,&nbsp;she was&nbsp;very&nbsp;reluctant&nbsp;at&nbsp;first, &nbsp; but when I introduced my&nbsp;mother to Ayesha, I knew that it was my&nbsp;best &nbsp; decision in&nbsp;my life,&nbsp;Ayesha took&nbsp;care&nbsp;of&nbsp;her&nbsp;and fitted&nbsp;my mother&nbsp;with her&nbsp;best &nbsp; product, to say frankly, my mother looked 10 years young. &nbsp; She was flabbergasted and My mother&nbsp;was really&nbsp;happy to&nbsp;see herself&nbsp;with &nbsp; complete hair after a long&nbsp;time. She loved the&nbsp;way she&nbsp;looked now&nbsp;and&nbsp;now &nbsp; she is roaming happily around. &nbsp; To add we got three wigs for her. &nbsp; Their products&nbsp;are flawless&nbsp;and&nbsp;hand made,&nbsp;and&nbsp;impressive.&nbsp;It&nbsp;doesn't look&nbsp;like &nbsp; artificial hair wig, it looks very&nbsp;natural as if&nbsp;it's our own&nbsp;hair.&nbsp;Completely &nbsp; harmless And Budget Friendly too. &nbsp; About their services,&nbsp;I'm&nbsp;totally&nbsp;more than happy,&nbsp;Ayesha is very&nbsp;friendly&nbsp;and &nbsp; doesn't push&nbsp;her&nbsp;customers&nbsp;to buy&nbsp;her&nbsp;products&nbsp;and&nbsp;she&nbsp;being&nbsp;a&nbsp;professional &nbsp; in this&nbsp;field, she&nbsp;explains&nbsp;and&nbsp;settles&nbsp;us&nbsp;with&nbsp;the&nbsp;best&nbsp;for&nbsp;us.&nbsp;She&nbsp;gives&nbsp;what&nbsp;you &nbsp; ask for. She is the perfectionist I have ever&nbsp;seen who takes care&nbsp;of&nbsp;every &nbsp; customers. &nbsp; I thank wholeheartedly Ayesha and her team for making&nbsp;my&nbsp;mother&nbsp;smile &nbsp; again, it means a lot to me and my family. You people are the best. &nbsp; Keep reaching heights. &nbsp; And my special&nbsp;thanks to Ayesha who made everything&nbsp;possible&nbsp;by&nbsp;her&nbsp;smile, &nbsp; wishing you a best of all. &nbsp; To precise about Wig - O - Mania ------ \"A MIRACLE \" &nbsp;","ID":"Ch 44 ","Response":"&nbsp; Hi Preethi. We are&nbsp;thrilled to receive&nbsp;such&nbsp;an overwhelming response&nbsp;from &nbsp; you. It&nbsp;is an&nbsp;absolute&nbsp;honour&nbsp;and&nbsp;a&nbsp;humbling&nbsp;experience&nbsp;for&nbsp;all&nbsp;of&nbsp;us&nbsp;at&nbsp;Wig-O- &nbsp; Mania for which&nbsp;we&nbsp;are ever&nbsp;so&nbsp;grateful&nbsp;to&nbsp;you.&nbsp;Making&nbsp;a&nbsp;difference in&nbsp;the&nbsp;life &nbsp; of each&nbsp;and every person who&nbsp;walks&nbsp;through&nbsp;our&nbsp;doors&nbsp;in&nbsp;our&nbsp;sincere&nbsp;intention &nbsp; and corporate&nbsp;CSR&nbsp;too.&nbsp;We&nbsp;are fully&nbsp;aware&nbsp;of&nbsp;the&nbsp;trauma that people with&nbsp;hair &nbsp; loss issues suffer and we ensure that our staff offer the best advise and &nbsp; recommend the ideal&nbsp;product. For&nbsp;us&nbsp;it is not&nbsp;selling but client&nbsp;satisfaction. &nbsp; Aysha is our diamond and indeed a the miracle worker who motivates &nbsp; everyone around her. We wish your mother the very best with long and &nbsp; healthy life and God Bless you for being a perfect daughter. &nbsp;"},{"Date":"25-Feb-2019","Name":" Janaki Kayarat &nbsp;","Content":"Wig-o. My God !!! &nbsp; Aisha and team you deserve more than 5 ratings . &nbsp; They made me comfortable , secure . Love you gus. &nbsp;","ID":"Ch 41 ","Response":"&nbsp; Thank you so much for your review and ratings. &nbsp; We are&nbsp;thrilled&nbsp;to&nbsp;note that we&nbsp;have&nbsp;made&nbsp;a&nbsp;difference in&nbsp;your&nbsp;life&nbsp;and&nbsp;hence &nbsp; deserved your rating and best wishes. &nbsp;"},{"Date":"25-Nov-2018","Name":" Dhanashree Vernekar &nbsp;","Content":"My mother recently ordered her wig and she is very satisfied with the product. &nbsp; We are so happy too to see her in her new look. &nbsp; Thank you very much for this. &nbsp; She needed it! &nbsp;","ID":"Ch 30 ","Response":"&nbsp; Your review and comments has made our day. &nbsp; It is a great feeling to&nbsp;be&nbsp;appreciated and it&nbsp;is more so when we make&nbsp;a &nbsp; difference in someone's lives. &nbsp; Our product&nbsp;has&nbsp;not&nbsp;only&nbsp;made&nbsp;her&nbsp;feel&nbsp;happy&nbsp;but&nbsp;has brought happiness to&nbsp;all &nbsp; of you and that is the icing. &nbsp; May God Bless&nbsp;her&nbsp;and all&nbsp;of&nbsp;you&nbsp;for&nbsp;taking&nbsp;such good care&nbsp;of&nbsp;her&nbsp;and her&nbsp;well &nbsp; being &nbsp;"},{"Date":"25-Feb-2019","Name":" Meghna Khetrapal &nbsp;","Content":"Ayesha helped me a lot in selecting the right hair extensions and&nbsp;posted &nbsp; accessories also that I needed later on. &nbsp; I think the work she is doing fantastic. &nbsp; Further Ayesha is&nbsp;someone&nbsp;who is passionate about what&nbsp;she&nbsp;does&nbsp;and is&nbsp;a &nbsp; phone call away for all her customers. &nbsp; Had a very good experience. Lots of blessings and regards to Ayesha&nbsp;and &nbsp; team. :) &nbsp;","ID":"Ch 40 ","Response":"&nbsp; Thank you Meghna for your review and appreciation. &nbsp; We strive to&nbsp;ensure that&nbsp;every client&nbsp;that&nbsp;walks&nbsp;into our door is&nbsp;offered&nbsp;the &nbsp; most sincere advise and indeed solution for their hair loss. &nbsp; Most of&nbsp;them&nbsp;come&nbsp;with&nbsp;so&nbsp;much&nbsp;frustration&nbsp;due&nbsp;to&nbsp;failure&nbsp;in&nbsp;all&nbsp;other&nbsp;options &nbsp; they have tried. &nbsp; With our&nbsp;new&nbsp;online&nbsp;video&nbsp;conferencing&nbsp;-&nbsp;we are&nbsp;able&nbsp;to&nbsp;offer our services&nbsp;to &nbsp; those who cannot visit our hair studios too. &nbsp; Aysha is indeed&nbsp;our&nbsp;Kohinoor diamond&nbsp;who&nbsp;makes us proud&nbsp;of ourselves&nbsp;and &nbsp; we are of her. &nbsp;"},{"Date":"25-Feb-2019","Name":" Ganesh Sankaran &nbsp;","Content":"The place&nbsp;offers world&nbsp;class&nbsp;treatment&nbsp;for&nbsp;hair loss&nbsp;and&nbsp;stylists&nbsp;there do&nbsp;a&nbsp;great &nbsp; job. &nbsp; The maintenance they give after treatment is good as well. &nbsp; Definitely worth its money nd you can try fa suree if needed for hair issues. &nbsp; ","ID":"Ch 39 ","Response":"&nbsp; Thank you so much For your kind words of appreciation and review. &nbsp; It makes us work harder for the cause&nbsp;of \"making a&nbsp;difference in&nbsp;people's &nbsp; lives\". &nbsp; Being a UK brand we endevour&nbsp;to&nbsp;introduce&nbsp;not&nbsp;only&nbsp;the brand, the&nbsp;product &nbsp; but also the customer service culture into the market. &nbsp;"},{"Date":"25-Jan-2019","Name":" Ranjana Rajan &nbsp;","Content":"If you&nbsp;need a&nbsp;fairy&nbsp;godmother&nbsp;to help&nbsp;you find&nbsp;a&nbsp;solution&nbsp;to&nbsp;hairloss&nbsp;that is&nbsp;just &nbsp; not controlled by tons of medications and lotions, then go to Wigomania. &nbsp; Aysha is your fairy godmother there with a magic wand. &nbsp; She will&nbsp;select&nbsp;a&nbsp;hair piece or&nbsp;a&nbsp;wig for you according to your&nbsp;requirements &nbsp; which will not look artificial. &nbsp; She will&nbsp;also spend as&nbsp;many&nbsp;hours&nbsp;as&nbsp;required&nbsp;to ensure&nbsp;that you&nbsp;settle&nbsp;down &nbsp; well with it. &nbsp; So why shy away from these gorgeous hair pieces. &nbsp; Just go&nbsp;to her&nbsp;and&nbsp;you will realise&nbsp;you&nbsp;are&nbsp;not&nbsp;the&nbsp;only&nbsp;one&nbsp;that&nbsp;needs&nbsp;it. &nbsp;","ID":"Ch 37 ","Response":"&nbsp; Thanks so much Mr Rajan for your glowing appreciations and thoughts. &nbsp; We agree with you&nbsp;that&nbsp;Aysha mothers&nbsp;everyone irrespective of age&nbsp;both &nbsp; male\/female. &nbsp; She takes it&nbsp;as&nbsp;a&nbsp;personal agenda to&nbsp;ensure&nbsp;that&nbsp;every&nbsp;client&nbsp;is&nbsp;offered&nbsp;exactly &nbsp; what they need which sometimes is not what they want or believe they need. &nbsp; We are&nbsp;so&nbsp;proud of&nbsp;her as&nbsp;she follows&nbsp;the&nbsp;principal that&nbsp;our&nbsp;company&nbsp;has&nbsp;laid &nbsp; down as&nbsp;its&nbsp;motto&nbsp;- \"To&nbsp;make a difference in&nbsp;people's lives\" Once&nbsp;again&nbsp;a&nbsp;Big &nbsp; Thank you for your review. &nbsp; God Bless &nbsp;"},{"Date":"25-Oct-2018","Name":" naveen boxer &nbsp;","Content":"I went for my relatives to this shop. &nbsp; Let Customer friendly&nbsp;they explained each&nbsp;and&nbsp;every thing&nbsp;politely&nbsp;and&nbsp;clearly &nbsp; until customer understands.. &nbsp; They come up with quality products and value for money.. fully satisfied… &nbsp;","ID":"Ch 25 ","Response":"&nbsp; Hi Naveen, thank you for your appreciation. &nbsp; We are pleased to hear that our products have fully satisfied your relatives. &nbsp; We believe in building a customer friendly relationship and explain to them the &nbsp; best possible solutions available. &nbsp; Do visit us again as we would love to have you back. &nbsp;"},{"Date":"25-Oct-2018","Name":" Meenakshisundaram Venkatachalam &nbsp;","Content":"My first impression: This place knows what they are doing. &nbsp; Great products, value for money, friendly. &nbsp; I loaded them&nbsp;with&nbsp;questions in few sittings and&nbsp;they where&nbsp;very patience&nbsp;in &nbsp; explaining the details. &nbsp; Outcome is great. &nbsp;","ID":"Ch 24 ","Response":"&nbsp; Thanks so much for your review, observations and indeed appreciation. &nbsp; We are thrilled&nbsp;to&nbsp;note that&nbsp;you too&nbsp;find&nbsp;our&nbsp;products&nbsp;exclusive&nbsp;and&nbsp;value&nbsp;for &nbsp; money. &nbsp; As Wig-O-Mania are&nbsp;designers, manufacturers&nbsp;and&nbsp;importers&nbsp;of our&nbsp;range&nbsp;we &nbsp; are able to&nbsp;offer&nbsp;exclusive designs, quality&nbsp;assured and best&nbsp;possible price&nbsp;for &nbsp; the same. &nbsp; Our staff&nbsp;are trained&nbsp;by Head Office&nbsp;in&nbsp;UK&nbsp;to&nbsp;ensure&nbsp;each&nbsp;client&nbsp;is offered&nbsp;the &nbsp; best service with patience and the right product too. &nbsp; Best wishes &nbsp;"},{"Date":"25-Dec-2018","Name":" Gagan Kapoor &nbsp;","Content":"Hi this is Gagan Kapoor and let me be as frank and real as I can get.... &nbsp; I have had hair issues and I had tried many before… &nbsp; .got so frustrated that I thought I rather shave off my head and having said that &nbsp; I really looked Uber cool.... &nbsp; then one day I just&nbsp;bumped into wigomania website&nbsp;and started&nbsp;chatting &nbsp; online with one unknown voice behind me.... &nbsp; my experience from there&nbsp;till&nbsp;I went&nbsp;and&nbsp;met that person at the studio&nbsp;was &nbsp; remarkable bcos she only said what was&nbsp;right&nbsp;and she is none other&nbsp;than &nbsp; Ayesha.... &nbsp; she said that I look cool without hair but when you have the option.... &nbsp; no harm trying it out.... &nbsp; what a makeover.... &nbsp; i took&nbsp;my&nbsp;loving wife&nbsp;who&nbsp;backs&nbsp;my&nbsp;decision if&nbsp;she thinks I&nbsp;m&nbsp;right and&nbsp;she&nbsp;said &nbsp; go for it.... &nbsp; the results truly are phenomenal and I m flowered with praises from all &nbsp; corners.... &nbsp; thank you Ayesha&nbsp;for all your&nbsp;support and thank you for&nbsp;that&nbsp;stylist&nbsp;who&nbsp;gave &nbsp; me a picture perfect look.... &nbsp; before I forget I want to&nbsp;thank&nbsp;Mrs&nbsp;Vasundhara from visible difference who&nbsp;I &nbsp; look up to&nbsp;for&nbsp;everything as&nbsp;she&nbsp;is one of&nbsp;nicest persons I&nbsp;have&nbsp;come&nbsp;across&nbsp;in &nbsp; my life.... &nbsp; thank you wigomania...Ayesha.... &nbsp; my wife and Vasundhara for helping me reinvent myself. &nbsp;","ID":"Ch 33 ","Response":"&nbsp; Hi Gagan. &nbsp; We are&nbsp;absolutely thrilled to receive your glowing appreciation and&nbsp;indeed &nbsp; your satisfaction with our exclusive range of hair pieces. &nbsp; It reassures&nbsp;all of&nbsp;us&nbsp;from&nbsp;HO&nbsp;level&nbsp;down&nbsp;to the&nbsp;Studio&nbsp;that&nbsp;we&nbsp;are&nbsp;doing&nbsp;things &nbsp; right and&nbsp;more&nbsp;importantly&nbsp;following the&nbsp;core principals&nbsp;of&nbsp;the Brand&nbsp;in UK&nbsp;of &nbsp; making a difference in people's lives. &nbsp; Aysha is without doubt our \"Kohinoor diamond\" and is renowned for her &nbsp; candid comments and sincere advise. &nbsp; Mrs Vasundhra is truly Wig-O-Mania's closest ally and a good friend of&nbsp;Mr &nbsp; Hasnain our CEO. We&nbsp;wish&nbsp;you the&nbsp;best&nbsp;in your&nbsp;newly&nbsp;found personality&nbsp;and &nbsp; may you have more success. &nbsp; God Bless &nbsp;"},{"Date":"25-Nov-2018","Name":" Meditation om &nbsp;","Content":"Dear Ayesha, &nbsp; This was a few months ago&nbsp;when after&nbsp;shaving&nbsp;my hair&nbsp;completely&nbsp;and&nbsp;partly &nbsp; heart broken i came down to chennai. With lot of questions in mind..... &nbsp; What will i do. &nbsp; And then suddenly i started&nbsp;thinking&nbsp;of people who had&nbsp;lost their limbs&nbsp;and &nbsp; were still surviving happily. &nbsp; It suddenly struck&nbsp;that&nbsp;i&nbsp;should&nbsp;try a&nbsp;wig&nbsp;and&nbsp;here&nbsp;was&nbsp;my&nbsp;sister&nbsp;in law&nbsp;daksha &nbsp; bhabhi who knew something about wig-o-mania. &nbsp; She immediately offered to take me. &nbsp; And we reached the hair shoppee. &nbsp; The shoppee had&nbsp;a&nbsp;great ambience&nbsp;and&nbsp;i&nbsp;should&nbsp;mention about&nbsp;your&nbsp;manager &nbsp; ayesha who very gracefylly took me through the process. &nbsp; Time and again she solved all my queries. &nbsp; When ever i needed her she was there to solve my problem. &nbsp; I still&nbsp;remember time and agin she&nbsp;was&nbsp;requesting&nbsp;me to&nbsp;try&nbsp;the&nbsp;wig,&nbsp;so&nbsp;that &nbsp; ones i am in mumbai i will not face problem. &nbsp; I am happy and i am enjoying it thorouhly, it has made me more confident. &nbsp; Thanks to all the lovely staffs of wig o mania especially ayesha what an &nbsp; excellent human being. &nbsp; Thanks ones again. &nbsp; Though i found the wig a little costly, i am happy. &nbsp; With that happy note i would say love you dear, thank you. &nbsp;","ID":"Ch 29 ","Response":"&nbsp; Thank you so much for your time to write us such beautiful thoughts and &nbsp; appreciating our work. &nbsp; It makes us all the&nbsp;more&nbsp;passionate about&nbsp;what&nbsp;we do knowing&nbsp;that we&nbsp;are &nbsp; truly making a difference in people's lives. &nbsp; We are thrilled&nbsp;to&nbsp;hear that you were impressed with&nbsp;our ambience,&nbsp;our &nbsp; compassion and commitment to ensure we offer the best advise and product. &nbsp; Aysha is certainly one of a kind who is willing to go to any length to ensure that &nbsp; each person who walks through our doors or connects with&nbsp;us&nbsp;is&nbsp;offered &nbsp; sincere advise and solution. &nbsp;"},{"Date":"25-Dec-2018","Name":" Latta Rai &nbsp;","Content":"Hair piece for which I m looking finally I got from this site. &nbsp; it has really fulfilled my problem I was going through.. &nbsp; I m happy n&nbsp;satisfied with this&nbsp;product n&nbsp;I&nbsp;had&nbsp;even recommended it&nbsp;to&nbsp;my &nbsp; friends n relative. &nbsp; thanks to&nbsp;Ayesha&nbsp;for&nbsp;ur&nbsp;best&nbsp;Costomer&nbsp;service&nbsp;n&nbsp;time&nbsp;you&nbsp;gave&nbsp;me. &nbsp; n ur choice of product for me. &nbsp; Though the price is little&nbsp;costly but thanks Ayesha&nbsp;you&nbsp;provided me&nbsp;on &nbsp; discount rate which ws on during diwali offer. &nbsp;","ID":"Ch 32 ","Response":"&nbsp; It is indeed a great feeling to not only be appreciated but also to know what we &nbsp; have once again&nbsp;made&nbsp;a difference in&nbsp;people's&nbsp;lives with&nbsp;our&nbsp;products&nbsp;and&nbsp;our &nbsp; service. Aysha&nbsp;is indeed&nbsp;renowned&nbsp;for&nbsp;her&nbsp;compassion&nbsp;and&nbsp;ensuring that&nbsp;every &nbsp; person who visits us&nbsp;is&nbsp;offered the&nbsp;best advise, service&nbsp;and product&nbsp;that&nbsp;will &nbsp; help her cause. &nbsp; Thank you for such for recommending us to your friends and family. &nbsp; It is a very satisfying feeling to be part of a chain of people to help others. &nbsp;"},{"Date":"25-Nov-2018","Name":" Ann Ramona &nbsp;","Content":"I am 54, and&nbsp;just like most ladies my&nbsp;age, dealing with hair&nbsp;thinning&nbsp;and&nbsp;hair &nbsp; loss. &nbsp; My hair loss treatment is going on&nbsp;but&nbsp;I&nbsp;realised that it was going to take&nbsp;a &nbsp; while before I get back my hair. &nbsp; I wanted to have my hair back and I wanted it fast. &nbsp; Someone&nbsp;suggested I use hair pieces or&nbsp;‘wigs’. OMG thought I . . .&nbsp;how &nbsp; terrible&nbsp;(I&nbsp;have&nbsp;seen&nbsp;quite&nbsp;a&nbsp;few&nbsp;people&nbsp;with&nbsp;badly fitted wigs&nbsp;and&nbsp;pathetic &nbsp; hair pieces). &nbsp; I was apprehensive. &nbsp; I thought good wigs were&nbsp;frightfully expensive&nbsp;and only for movie&nbsp;stars&nbsp;who &nbsp; could both afford to get them from abroad and maintain it as well ! &nbsp; What do I do to sport some hair on my head? I decided to check. &nbsp; I browsed&nbsp;and&nbsp;browsed&nbsp;and&nbsp;also consulted my physician if using one&nbsp;could &nbsp; have any adverse effects on my already falling hair. &nbsp; Google showed&nbsp;me&nbsp;many&nbsp;options&nbsp;and&nbsp;after&nbsp;all&nbsp;that research&nbsp;for&nbsp;two months,&nbsp;it &nbsp; boiled down to finding the right vendor. &nbsp; I found ‘Wigomania’ a UK based product vendor&nbsp;and met Aysha who&nbsp;knew &nbsp; exactly what I needed. &nbsp; With the&nbsp;ease of&nbsp;a professional, she had&nbsp;me&nbsp;fitted&nbsp;in no&nbsp;time, with&nbsp;something &nbsp; that was both practical and perfect for my need. &nbsp; I was impressed. &nbsp; Wigomania not only had top of the line products with a variety&nbsp;to choose, from &nbsp; a classy outlet, it had staff to match. &nbsp; Their products are priced well and offer great value for money. &nbsp; They also lend after sales&nbsp;assistance&nbsp;in&nbsp;washing&nbsp;or maintaining their&nbsp;products, &nbsp; should we need them. &nbsp; I bought what I needed and also something I wanted. &nbsp; I thought …. after&nbsp;all we spend&nbsp;a&nbsp;lot&nbsp;more&nbsp;on&nbsp;lot&nbsp;less … this is MY&nbsp;CROWNING &nbsp; GLORY so why not ! Thank you Aysha ! &nbsp;","ID":"Ch 28 ","Response":"&nbsp; Hi Ann...Thank you so much for your kind words and appreciation. &nbsp; It makes our&nbsp;objective&nbsp;to serve and&nbsp;make&nbsp;a&nbsp;difference&nbsp;in&nbsp;people's lives all&nbsp;the &nbsp; more stronger&nbsp;and encourages&nbsp;us&nbsp;to&nbsp;keep going on doing the&nbsp;same thing&nbsp;each &nbsp; day. &nbsp; Your thoughts&nbsp;are a great&nbsp;motivator&nbsp;for&nbsp;our&nbsp;excellent&nbsp;team&nbsp;in&nbsp;Chennai&nbsp;-&nbsp;each&nbsp;of &nbsp; them are brilliant in what they do and indeed Aysha heads it. &nbsp; She is very special. &nbsp;"},{"Date":"25-Dec-2018","Name":" Lakshmi Sadhik &nbsp;","Content":"Friendly ayisha.... awesome service...cost worth..very satisfied.. &nbsp;","ID":"Ch 31 ","Response":"&nbsp; Thank you very much for your review and appreciation. &nbsp; We are thrilled to note&nbsp;that we have been able to make you happy&nbsp;and &nbsp; satisfied with her products, service and value for money. &nbsp; We are here to make a difference in people's lives. &nbsp;"},{"Date":"25-Sep-2018","Name":" priya ganesh &nbsp;","Content":"Hi I have went for my hair problems in&nbsp;wio&nbsp;o mani and came out&nbsp;with &nbsp; satisfaction. &nbsp; Nishi has&nbsp;teaching&nbsp;me&nbsp;on&nbsp;the solutions&nbsp;and is&nbsp;very friendly talk,&nbsp;She&nbsp;suggests &nbsp; the best and she can be completely trusted for services. &nbsp; I liked the&nbsp;varieties&nbsp;of&nbsp;products&nbsp;and&nbsp;wonderful&nbsp;customer&nbsp;service&nbsp;offered,&nbsp;well &nbsp; certainly recommend to everyone. &nbsp;","ID":"Ch 23 ","Response":"&nbsp; Hi Priya. We are thrilled&nbsp;to hear about yet&nbsp;another&nbsp;happy&nbsp;satisfied client&nbsp;of &nbsp; ours. &nbsp; Nishi is indeed&nbsp;a&nbsp;very&nbsp;responsible,&nbsp;matured&nbsp;and&nbsp;sincere&nbsp;staff who&nbsp;always&nbsp;gives &nbsp; that extra personal touch&nbsp;to&nbsp;every&nbsp;client&nbsp;with&nbsp;our&nbsp;advise&nbsp;due to&nbsp;her&nbsp;experience &nbsp; and product knowledge. &nbsp; It is indeed&nbsp;the&nbsp;policy&nbsp;of&nbsp;Wig-O-Mania&nbsp;to&nbsp;ensure&nbsp;the best solution&nbsp;is&nbsp;offered&nbsp;to &nbsp; all our patrons. &nbsp;"},{"Date":"25-Jan-2019","Name":" Roshan kumar &nbsp;","Content":"any one&nbsp;of the past customer&nbsp;can&nbsp;you please&nbsp;share the life expectancy&nbsp;of&nbsp;the &nbsp; wig? &nbsp; As I am looking for a glue paste model wig in wig o mania? &nbsp;","ID":"Ch 35 ","Response":"&nbsp; Dear Mr Kumar, Kindly read the reviews and you should get your answers. &nbsp; However keep in mind it all depends on the way it is used, how much&nbsp;you &nbsp; sweat and the reaction of the sweat on your&nbsp;scalp, how long&nbsp;are you in&nbsp;the &nbsp; sun, heat and&nbsp;also mainly how&nbsp;you react&nbsp;to the occasional itch&nbsp;that&nbsp;you&nbsp;may &nbsp; get because of your sweat (nothing to do with our product). &nbsp; If you are&nbsp;going&nbsp;to be&nbsp;in&nbsp;sun&nbsp;long hours,&nbsp;resulting&nbsp;in sweating then we&nbsp;suggest &nbsp; you opt&nbsp;for&nbsp;MonoBase clip&nbsp;which&nbsp;certainly is&nbsp;longer&nbsp;lasting,&nbsp;more durable&nbsp;and &nbsp; does not need servicing as regularly as a glue paste toupee. &nbsp; This is our professional advise, suggestion and recommendation. &nbsp;"},{"Date":"11-Mar-2019","Name":" prasanna leela &nbsp;","Content":"Hi this is leela.. &nbsp; Wig-O-Mania is an instant solution for hairloss. &nbsp; There are&nbsp;many&nbsp;varieties&nbsp;of&nbsp;hairpieces&nbsp;are&nbsp;available in&nbsp;the&nbsp;store which&nbsp;is&nbsp;great &nbsp; value for money and Thank you Aysha for all your support. &nbsp;","ID":"Ch 43 ","Response":"&nbsp; Hi Leela… &nbsp; Thank you so much for your review and ratings. &nbsp; We are&nbsp;thrilled&nbsp;to&nbsp;note that we&nbsp;have&nbsp;made&nbsp;a&nbsp;difference in&nbsp;your&nbsp;life&nbsp;and&nbsp;hence &nbsp; deserved your rating and best wishes. &nbsp; Our team&nbsp;headed by Aysha does an excellent job to ensure every&nbsp;client&nbsp;is &nbsp; given her best attention, advise and product &nbsp;"},{"Date":"25-Sep-2018","Name":" Regina Arulraj &nbsp;","Content":"Very good options&nbsp;to try&nbsp;out&nbsp;and&nbsp;Aysha&nbsp;at Chennai gives&nbsp;you&nbsp;excellent&nbsp;service &nbsp; and you can select based on your budget and need . &nbsp;","ID":"Ch 22 ","Response":"&nbsp; Thank you so&nbsp;much&nbsp;Regina&nbsp;for&nbsp;your review,&nbsp;comments&nbsp;and&nbsp;appreciation.&nbsp;Being &nbsp; a UK&nbsp;Hair&nbsp;Brand&nbsp;-&nbsp;the&nbsp;1st&nbsp;of&nbsp;its kind&nbsp;in India&nbsp;we&nbsp;offer&nbsp;a&nbsp;very&nbsp;wide&nbsp;range of&nbsp;hair &nbsp; pieces to suit&nbsp;every requirement,&nbsp;style, colour and&nbsp;also&nbsp;budget. We are&nbsp;glad &nbsp; you got the product of your choice and budget. Thank you for your patronage. &nbsp;"},{"Date":"25-Nov-2018","Name":"&nbsp;jaya pragash &nbsp;","Content":"Fabulous experience. &nbsp; Team Aysha you&nbsp;guys&nbsp;really&nbsp;deserve five star&nbsp;for such a professional&nbsp;work &nbsp; done .&nbsp;Special&nbsp;thanks to&nbsp;Mr John&nbsp;as&nbsp;proven&nbsp;his&nbsp;skills and&nbsp;thanks&nbsp;Nisha for&nbsp;your &nbsp; patience follow up. &nbsp; All the very best. &nbsp; egards Dr jayapragash. &nbsp;","ID":"Ch 27 ","Response":"&nbsp; Thank you&nbsp;so&nbsp;much Dr Jayapragash&nbsp;for&nbsp;your valuable comments,&nbsp;appreciation &nbsp; and review. &nbsp; It is an absolute honour to have served you. &nbsp; It means a lot to us when a Doctor appreciates our good work. &nbsp; Being the 1st UK&nbsp;Hair Brand in India&nbsp;we&nbsp;are&nbsp;committed&nbsp;to ensure&nbsp;enhanced &nbsp; end user experience for every client that walks thru our door. &nbsp; For this our staff are professionally trained and qualified. &nbsp; We are thrilled to note that they are doing a good &nbsp;"},{"Date":"25-Aug-2018","Name":"&nbsp;Ravishankar rajendran &nbsp;","Content":"Excellent products &amp; great customer service !! &nbsp; We get exactly what we need.. &nbsp; worth for the money… &nbsp;","ID":"Ch 21 ","Response":"&nbsp; Thank you very much Ravishankar for your appreciation and review. &nbsp; As a brand we ensure every person that walks through our&nbsp;doors&nbsp;is&nbsp;offered &nbsp; exemplary service and best advise as a solution to their age old&nbsp;problems&nbsp;of &nbsp; hair loss. &nbsp; As our&nbsp;clients&nbsp;deal directly&nbsp;with the&nbsp;Brand&nbsp;the&nbsp;prices we&nbsp;offer&nbsp;are&nbsp;indeed&nbsp;great &nbsp; value for money. &nbsp;"},{"Date":"25-Aug-2018","Name":"&nbsp;Alosius Gracy &nbsp;","Content":"Best products at best price.... &nbsp; nd different varieties too.... &nbsp; Awesome ambience nd very welcoming staff.... &nbsp; above all&nbsp;Ayesha&nbsp;ma'am&nbsp;s&nbsp;a&nbsp;real&nbsp;sweetheart&nbsp; &nbsp;","ID":"Ch 20 ","Response":"&nbsp; Thanks so much for your gracious appreciation and review. &nbsp; We are thrilled to note that you have had a great experience at our store. &nbsp; Indeed our&nbsp;staff are&nbsp;trained&nbsp;by our&nbsp;UK Head&nbsp;office&nbsp;to ensure&nbsp;that&nbsp;we&nbsp;make&nbsp;a &nbsp; difference in people's lives. &nbsp; Aysha is the icing on the cake. :) &nbsp;"},{"Date":"25-Aug-2018","Name":" Ashwin MOHAN &nbsp;","Content":"These people are good at what they do! &nbsp; And they put their customers needs ahead of em always, &nbsp; a vote of ayesha naseem. &nbsp; Wig-O-Mania &nbsp; Response &nbsp; Thanks Ashwin for your appreciation. &nbsp; Indeed this&nbsp;is the&nbsp;philosophy&nbsp;and&nbsp;part&nbsp;of&nbsp;Wig-O-Mania&nbsp;work&nbsp;ethics&nbsp;whereby&nbsp;we &nbsp; ensure that&nbsp;our&nbsp;staff&nbsp;offers the&nbsp;best&nbsp;advise to our clients and&nbsp;do&nbsp;not&nbsp;hard&nbsp;sell &nbsp; anything to them. &nbsp; We are happy&nbsp;to&nbsp;hear directly&nbsp;from&nbsp;clients that the practise is followed&nbsp;to&nbsp;the &nbsp; \"T\" by our team. &nbsp;","ID":"Ch 19 ","Response":""},{"Date":"25-Aug-2018","Name":" Anoosha Anoo &nbsp;","Content":"Ayeesha Im so happy with your service.. &nbsp; Im really satisfied. Thank you so much. &nbsp;","ID":"CH 18 ","Response":"&nbsp; Thank you so much for your review and appreciation. &nbsp; Glad to note that you are fully satisfied with our service. &nbsp; Aysha indeed is the icing on the cake. &nbsp;"},{"Date":"25-Aug-2018","Name":" Priya D &nbsp;","Content":"I had recently visited them&nbsp;and bought&nbsp;a product of theirs for my&nbsp;scanty&nbsp;hair &nbsp; arising out of medical conditions which was worrying me infinitely. &nbsp; Having read about&nbsp;them here in&nbsp;google, i&nbsp;decided&nbsp;to give&nbsp;it a&nbsp;shot and&nbsp;happy &nbsp; that i&nbsp;did. &nbsp; Ayesha is patient and&nbsp;explains&nbsp;well&nbsp;and&nbsp;recommendeds&nbsp;the right solutions&nbsp;for &nbsp; the indivual customer. &nbsp; The product is of high quality and they&nbsp;try to match the&nbsp;product as&nbsp;per &nbsp; customer wish. &nbsp; I wanted slight changes to the product after sale and even their after sale &nbsp; service was on par, i ended buying a second product :) . &nbsp; They have&nbsp;a&nbsp;vairtey&nbsp;of solutions&nbsp;and&nbsp;i&nbsp;would&nbsp;recommend this&nbsp;for users&nbsp;of&nbsp;both &nbsp; types, whether necessity or fashion !. &nbsp; Thank you team for making my daily life easier.. &nbsp;","ID":"CH 17 ","Response":"&nbsp; Hi Priya &nbsp; Thank you so much for taking out time to write us&nbsp;a great review.&nbsp;We&nbsp;are &nbsp; thrilled to&nbsp;hear&nbsp;that&nbsp;you&nbsp;have&nbsp;been&nbsp;well&nbsp;taken&nbsp;care&nbsp;of, truly&nbsp;satisfied with&nbsp;our &nbsp; personalised service and indeed impressed with our range of products. &nbsp; Being a&nbsp;UK Hair&nbsp;Brand -&nbsp;the&nbsp;1st&nbsp;of&nbsp;a&nbsp;kind&nbsp;in India&nbsp;we are&nbsp;proud&nbsp;to offer a&nbsp;wide &nbsp; range of&nbsp;hair pieces that cater to all kind of&nbsp;hair issues&nbsp;-&nbsp;be&nbsp;it for&nbsp;fashion&nbsp;or &nbsp; more importantly&nbsp;necessity&nbsp;wearers.&nbsp;The&nbsp;latter&nbsp;Preethi&nbsp;Dayanand &nbsp; are the&nbsp;delicate and&nbsp;frustrated&nbsp;ones&nbsp;who&nbsp;have&nbsp;tried&nbsp;all&nbsp;kinds of&nbsp;treatments&nbsp;and &nbsp; medicine. &nbsp; We boast of offering an Instant Solution thereby&nbsp;bringing&nbsp;a difference&nbsp;in &nbsp; people's lives. &nbsp; Receiving appreciations such as yours motivates us further. We therefore &nbsp; thank you for your kind words &nbsp;"},{"Date":"25-Aug-2018","Name":"&nbsp;Preethi Dayanand &nbsp;","Content":"I visited Wigomania absolutely clueless of what is in store for me there. &nbsp; I have scanty&nbsp;hair&nbsp;and&nbsp;was&nbsp;looking&nbsp;for&nbsp;solutions that don't require&nbsp;me&nbsp;to&nbsp;take &nbsp; any medications or surgery. &nbsp; I took 4 hours to choose and get convinced that I was in the right place. &nbsp; Ayesha is the one you&nbsp;need&nbsp;to&nbsp;talk to.&nbsp;.. &nbsp; She is extremely knowledgeable, personable and forthcoming with all the &nbsp; information needed. &nbsp; She made me feel&nbsp;comfortable and helped me over come my inhibitions&nbsp;at &nbsp; ease. &nbsp; I left wigomania looking 10 years younger. &nbsp;","ID":"CH 16 ","Response":"&nbsp; Hi Preethi. &nbsp; We are thrilled to hear that you are another of our very satisfied client. &nbsp; It is our&nbsp;motto&nbsp;and&nbsp;indeed the&nbsp;passion&nbsp;of&nbsp;all&nbsp;our&nbsp;staff&nbsp;to&nbsp;ensure&nbsp;that&nbsp;they&nbsp;offer &nbsp; the best advise and the correct product to all our clients. &nbsp; Being patient and empathy to&nbsp;every person's situation is important and&nbsp;we &nbsp; train our staff at it. &nbsp; Ms Aysha our Stores Director is indeed the leader in the fore and she &nbsp; motivates everyone too. &nbsp; Your review has motivated all of us to keep working on this concept. &nbsp; Thank you and God Bless. &nbsp;"},{"Date":"25-Jul-2018","Name":" Muthukumaran Shanmugam &nbsp;","Content":"Our experience with&nbsp;Chennai&nbsp;Wigomania was miraculous&nbsp;For&nbsp;more&nbsp;than&nbsp;25 &nbsp; years my&nbsp;wife&nbsp;was having&nbsp;an&nbsp;inferiority&nbsp;complex,&nbsp;that&nbsp;she is having&nbsp;a&nbsp;short&nbsp;hair &nbsp; and she can't enjoy hair styles of this generation. &nbsp; When we&nbsp;landed&nbsp;in&nbsp;Chennai&nbsp;from&nbsp;Paris,&nbsp;straight&nbsp;away&nbsp;we&nbsp;went to&nbsp;Wigomania &nbsp; and they&nbsp;gave&nbsp;a very&nbsp;easy&nbsp;and&nbsp;very practical&nbsp;solution&nbsp;within&nbsp;just&nbsp;two&nbsp;hours&nbsp;and &nbsp; my wife's joy found no limits. &nbsp; The store manager was very courteous and the staffs support was brilliant. &nbsp; Now my wife is enjoying her holidays very happyly. &nbsp; Tq so&nbsp;much&nbsp;Wigomania&nbsp;for&nbsp;transforming&nbsp;our&nbsp;lives&nbsp; &nbsp;","ID":"CH 15 ","Response":"&nbsp; We are absolutely&nbsp;delighted to&nbsp;have&nbsp;received&nbsp;such a&nbsp;warm and&nbsp;from&nbsp;the&nbsp;heart &nbsp; compliment and appreciation. &nbsp; While we strive to&nbsp;make&nbsp;a difference in&nbsp;every client's&nbsp;life who&nbsp;touch&nbsp;us&nbsp;-&nbsp;but&nbsp;it &nbsp; is such words which really make the&nbsp;difference in the life of our&nbsp;staff&nbsp;and &nbsp; indeed for our Brand. &nbsp; We thank you for your kind words and assure you that it has made our &nbsp; commitment more stronger to serve. &nbsp; God Bless you and your family. &nbsp;"},{"Date":"25-Jun-2018","Name":" Asheesh Kumar &nbsp;","Content":"Excellent quality… &nbsp; n looks like natural hair.. &nbsp; I love it. &nbsp;","ID":"CH 14 ","Response":"&nbsp; Thanks for your compliment. &nbsp; A UK&nbsp;brand&nbsp;hair&nbsp;piece&nbsp;comes with&nbsp;a&nbsp;guarantee of&nbsp;worksmanship&nbsp;that&nbsp;looks&nbsp;and &nbsp; feel natural always. &nbsp; We are here to make a difference in people's lives. &nbsp;"},{"Date":"25-Jun-2018","Name":"&nbsp;JJ Little Flower &nbsp;","Content":"It is&nbsp;not&nbsp;necessary&nbsp;to&nbsp;ask&nbsp;comments&nbsp;for&nbsp;improvement&nbsp;becaz&nbsp;ayeesha&nbsp;is&nbsp;enough &nbsp; to provide info to&nbsp;catch&nbsp;the&nbsp;customer&nbsp;and&nbsp;we&nbsp;received necessary&nbsp;guidance &nbsp; and satisfaction. &nbsp;","ID":"CH 13 ","Response":"&nbsp; Thank you so much for your valued comments and appreciation. &nbsp; We will not be complacent and continue to offer enhanced end user &nbsp; experience to all our patrons. &nbsp;"},{"Date":"25-Apr-2018","Name":" Santha Durai &nbsp;","Content":"Great service n well established shop. &nbsp; I personally like&nbsp;Ayesha way&nbsp;of&nbsp;talking&nbsp;She&nbsp;promotes well with&nbsp;good&nbsp;knowlege &nbsp; n genuine talk She is kind n understanding. &nbsp; Will continue to patronize in future &nbsp;","ID":"CH 12 ","Response":"&nbsp; Thanks very much for your gracious comments and appreciation. &nbsp; Wig-O-Mania staff are trained to offer an&nbsp;enhanced&nbsp;end user&nbsp;experience&nbsp;to &nbsp; every client that walks through it's door irrespective whether they end up &nbsp; buying or just want to educate themselves. &nbsp;"},{"Date":"25-Apr-2018","Name":" A K &nbsp;","Content":"First Impression:&nbsp;Awesome setup&nbsp;and&nbsp;you&nbsp;have&nbsp;come to&nbsp;the&nbsp;right&nbsp;place. &nbsp; Though the cost is very high, the product quality is really a thumbs up. &nbsp; even the customer service is awesome after selling the product. &nbsp; Ayesha was very&nbsp;Prompt&nbsp;and&nbsp;Timely&nbsp;response&nbsp;in&nbsp;addressing&nbsp;our&nbsp;queries.. &nbsp; Great Job. &nbsp;","ID":"CH 11 ","Response":"&nbsp; Thanks very much for your comments and appreciation. &nbsp; Wig-O-Mania offers&nbsp;the&nbsp;highest quality&nbsp;of band made&nbsp;hair pieces&nbsp;and as&nbsp;they &nbsp; are made abroad&nbsp;in its&nbsp;factories hence the cost is slightly&nbsp;higher&nbsp;due&nbsp;to&nbsp;import &nbsp; costs etc. Nevertheless we try our&nbsp;best to ensure&nbsp;it is affordable to&nbsp;every &nbsp; person irrespective of their budget.. &nbsp; hence hold a wide range. &nbsp;"},{"Date":"20-Feb-2018","Name":" Sathish kumar &nbsp;","Content":"Wig-O-mania.&nbsp;!!! &nbsp; Wow... &nbsp; Great varieties&nbsp;of&nbsp;products&nbsp;available&nbsp;at best&nbsp;price. &nbsp; Ms.Aysha suggestions definitely helped me out to go for the suitable product. &nbsp; And atlast Fantastic service done by Mr.John. &nbsp; Thanks a lot team. &nbsp;","ID":"Ch 10 ","Response":"&nbsp; Thank you for your kind words and appreciation… &nbsp; it helps us to be more determined&nbsp;in our&nbsp;efforts to make a difference in&nbsp;the &nbsp; lives of our patrons. &nbsp;"},{"Date":"01-Feb-2018","Name":" Vijaya Muralidharan &nbsp;","Content":"Went with such a heavy heart that —-- &nbsp; I am losing my— the once before beautiful precious tress! &nbsp; Met Aysha&nbsp;—&nbsp;who had&nbsp;an immediate solution with a crown topper&nbsp;!&nbsp;—&nbsp;— &nbsp; heaviness lifted slowly and steadily&nbsp;—&nbsp;as she&nbsp;started expaining and wore&nbsp;the &nbsp; piece on my balding crown — &nbsp; Immediate feeling&nbsp;as&nbsp;a newly&nbsp;CROWNED queen ! A&nbsp;jewel&nbsp;indeed&nbsp;—&nbsp;more&nbsp;than &nbsp; an accessory— &nbsp; Very natural&nbsp;human&nbsp;hair&nbsp;— &nbsp; Can’t thank&nbsp;Aysha&nbsp;enough&nbsp;—&nbsp;5\/5–&nbsp;to you&nbsp;(though&nbsp;u&nbsp;gave&nbsp;me only&nbsp;7\/10 for&nbsp;the &nbsp; exam rhat&nbsp;u&nbsp;held&nbsp;for&nbsp;my&nbsp;self&nbsp;-&nbsp;help&nbsp;wearing&nbsp;!) &nbsp; In cliched terms — &nbsp; EXCELLENT SERVICE&nbsp;AND SATISFACTION&nbsp;GUARANTEED! &nbsp; Thank you&nbsp;AYSHA&nbsp;!&nbsp;! &nbsp; And also Nishi and Jonah! &nbsp; Thanks to&nbsp;the&nbsp;owner&nbsp;sir (forgot&nbsp;to&nbsp;ask&nbsp;his&nbsp;name )—who&nbsp;thought&nbsp;of&nbsp;this&nbsp;venture &nbsp; in Chennai— &nbsp; Kudos to your effort! &nbsp; Kindly continue ! &nbsp; One small suggestion — &nbsp; Make them a little more&nbsp;affordable&nbsp;—&nbsp;sir&nbsp;,you&nbsp;know&nbsp;why?—&nbsp;i want to&nbsp;make &nbsp; my closet as a miniature of your shop! &nbsp;","ID":"Ch 09 ","Response":"&nbsp; We are so honoured to receive such a lavish compliment from you. &nbsp; Thrilled to&nbsp;know&nbsp;that&nbsp;our&nbsp;staff&nbsp;has&nbsp;offered&nbsp;you&nbsp;their&nbsp;best&nbsp;service,&nbsp;attention&nbsp;and &nbsp; product that suits your requirement. &nbsp; They are all trained to&nbsp;ensure that&nbsp;every person&nbsp;who walks into our Store&nbsp;is &nbsp; offered the best quality of support, advise and suitable product. &nbsp; We want to make a difference in&nbsp;people's lives&nbsp;and hence have opened&nbsp;our &nbsp; own brand stores to ensure the service that befits a UK brand is&nbsp;offered &nbsp; always. &nbsp; Noted about the pricing. &nbsp; While we promise&nbsp;and&nbsp;assure&nbsp;you&nbsp;of&nbsp;offering&nbsp;our&nbsp;products&nbsp;at the&nbsp;best&nbsp;possible &nbsp; price you&nbsp;would appreciate&nbsp;that we have to&nbsp;maintain&nbsp;our&nbsp;quality&nbsp;and&nbsp;standard &nbsp; to ensure the product we offer meets our client requirement and&nbsp;gives&nbsp;a&nbsp;long &nbsp; term value too. &nbsp; Having a closet&nbsp;of&nbsp;Wig-O-Mania is by far&nbsp;the&nbsp;bestest compliment we&nbsp;have &nbsp; received to date. You hereby are granted a permanent 10% discount from us. :) &nbsp;"},{"Date":"20-Feb-2018","Name":" Thenmozhi S &nbsp;","Content":"First of&nbsp;all am heartfully&nbsp;thanking you to&nbsp;Ayisha, for&nbsp;giving me&nbsp;artificial hair&nbsp;as &nbsp; so as natural. &nbsp; In this&nbsp;modern&nbsp;world&nbsp;with&nbsp;technologies&nbsp;advances&nbsp;artificial&nbsp;hair&nbsp;has&nbsp;come&nbsp;a&nbsp;long &nbsp; way in recent. &nbsp; As a matter of fact, with&nbsp;some of the&nbsp;higher quality&nbsp;of material, you&nbsp;would &nbsp; never know they were&nbsp;not&nbsp;natural human&nbsp;hair&nbsp;if&nbsp;you didn’t&nbsp;have the&nbsp;human &nbsp; hair right next to it to compare this way you have provided to me. &nbsp; Immensely feeling that your product is truely amazable. &nbsp; And nobody knows&nbsp;that&nbsp;am using&nbsp;an artificial&nbsp;hair,&nbsp;its making&nbsp;me&nbsp;to&nbsp;feel&nbsp;happy &nbsp; and be strong in this competitive world. &nbsp; Thanking you once again for feeling me natural. &nbsp;","ID":"Ch 08 ","Response":"&nbsp; Thank you so much for your kind words and appreciation. &nbsp; It makes all our hard&nbsp;work and commitment to&nbsp;make a difference to&nbsp;every &nbsp; person who walks into our stores worth our while. &nbsp; This is the motto&nbsp;of&nbsp;our&nbsp;Brand&nbsp;along with ensuring the&nbsp;bestest quality&nbsp;of&nbsp;hair &nbsp; piece that are manufactured by our factories. &nbsp; We are blessed&nbsp;to&nbsp;have&nbsp;a&nbsp;great dedicated&nbsp;team&nbsp;who&nbsp;offer sincere&nbsp;advise&nbsp;to&nbsp;our &nbsp; clients always. &nbsp; Please do visit us again when you can for a cup of coffee. God Bless &nbsp;"},{"Date":"21-Feb-2018","Name":"&nbsp;Chiraiya Mardia &nbsp;","Content":"Amazing service by Ayesha and amazing product suggestion.. &nbsp; great work done.. will always look forward to buy more products.. &nbsp;","ID":"Ch 07 ","Response":"&nbsp; Thank you so much for your comments and views. &nbsp; It is our&nbsp;privilege&nbsp;to be able to offer our best advise and&nbsp;suitable&nbsp;products&nbsp;to &nbsp; every client who walks thru our door. &nbsp; We look forward to your patronage in the future too and indeed &nbsp; recommendations which I&nbsp;believe you have&nbsp;already spoken about&nbsp;us&nbsp;to&nbsp;your &nbsp; family and friends. &nbsp; Highly appreciate that. &nbsp;"},{"Date":"22-Jan-2018","Name":" hasna beeran &nbsp;","Content":"Team Wigomania certainly deserves a pat&nbsp;for&nbsp;their warm client&nbsp;interaction &nbsp; which would make one feel at ease and choose the right product for oneself. &nbsp; Keep up the good job,Team! &nbsp;","ID":"Ch 06 ","Response":"&nbsp; Many thanks Ms Hasna for your valuable comments and indeed kind words. &nbsp; It makes&nbsp;our determination all the more&nbsp;stronger to&nbsp;ensure that&nbsp;we&nbsp;offer&nbsp;the &nbsp; best end user experience to each and every guest who visits us. &nbsp; We are blessed&nbsp;with&nbsp;a&nbsp;great&nbsp;team&nbsp;that is&nbsp;very&nbsp;conscious&nbsp;of&nbsp;the&nbsp;Brand&nbsp;motto &nbsp;"},{"Date":"20-Jan-2018","Name":" Durffsgjrga Vijayavarman &nbsp;","Content":"Hi I have personally visited here for hair problems and came&nbsp;out&nbsp;with &nbsp; satisfaction. Ayesha has vast knowledge on the solutions and is very friendly. &nbsp; She suggests the best for a person and can be completely trusted for services. &nbsp; I liked the varieties of products and wonderful customer service offered! &nbsp;","ID":"Ch 05 ","Response":"&nbsp; Thank you&nbsp;so&nbsp;much&nbsp;for&nbsp;conveying&nbsp;to&nbsp;us&nbsp;your&nbsp;experience&nbsp;at&nbsp;our&nbsp;Store. &nbsp; It makes everything we do so much more beautiful. &nbsp; We as a&nbsp;Brand&nbsp;and our&nbsp;team&nbsp;of&nbsp;dedicated&nbsp;staff headed by&nbsp;Store&nbsp;Director&nbsp;Aysha &nbsp; are indeed very passionate about our products and the value it brings to &nbsp; people's life. And to be appreciated for it is the icing on the cake. &nbsp; Do visit us in the future even if it just for a cuppa tea. God Bless You! &nbsp;"},{"Date":"18-Jan-2018","Name":" Sangita Mathivanam &nbsp;","Content":"Sangita....reviewed wigo-o-mania &nbsp; Hi here I m thanking Wigo-o-mania for an wonderful customer service, &nbsp; I had visited der for my hair&nbsp;probs so I got an instant solution and I&nbsp;fully &nbsp; satisfied with they product, bcoz&nbsp;of&nbsp;Ayesha mam, I&nbsp;really&nbsp;love her&nbsp;she s&nbsp;very &nbsp; friendly and supportive kindful person.... &nbsp; Bcoz of&nbsp;her&nbsp;I&nbsp;really personally refer&nbsp;to my&nbsp;Frnds,she gives us proper&nbsp;guidance &nbsp; and feel comfort and moderate pricing lots of varieties.... &nbsp; In case&nbsp;if v&nbsp;had any&nbsp;probs in&nbsp;dey product&nbsp;also Ayesha mam s ready&nbsp;to&nbsp;help&nbsp;n &nbsp; giving us d best solution.... &nbsp; Once again thank you mam &nbsp;","ID":"Ch 04 ","Response":"&nbsp; Hi Sangita, &nbsp; We are indeed honoured&nbsp;to&nbsp;have received&nbsp;such&nbsp;a glorifying appreciation&nbsp;for &nbsp; the work that we are doing at our Flagship store in Chennai. &nbsp; The core&nbsp;value of Wig-O-Mania&nbsp;of&nbsp;London is to ensure that&nbsp;each and&nbsp;every &nbsp; person that&nbsp;walks&nbsp;thru&nbsp;the&nbsp;door&nbsp;is&nbsp;given&nbsp;the&nbsp;highest&nbsp;level&nbsp;of&nbsp;service&nbsp;and&nbsp;sincere &nbsp; advice so that the objective is achieved. &nbsp; Each and every staff at our centres undergo intensive training for this. &nbsp; We look forward to your visit again and thank you for&nbsp;refering us to&nbsp;your &nbsp; friends. &nbsp; God Bless &nbsp;"},{"Date":"15-Jan-2018","Name":" Malar Shan &nbsp;","Content":"The store&nbsp;is&nbsp;user friendly&nbsp;and Ayesha&nbsp;is very&nbsp;knowledgeable and friendly.&nbsp;She &nbsp; gives you&nbsp;proper&nbsp;guidance. The whole setup&nbsp;makes&nbsp;you&nbsp;feel&nbsp;comfortable&nbsp;and &nbsp; confident. &nbsp;","ID":"Ch 36 ","Response":"&nbsp; Thanks very much Malar for your review and kind words. &nbsp; Indeed it&nbsp;is our philosophy&nbsp;to&nbsp;ensure that&nbsp;every client&nbsp;of&nbsp;ours&nbsp;is&nbsp;offered&nbsp;the &nbsp; best advise and information. &nbsp; We take our responsibility very seriously and ensure the same culture is passed &nbsp; on to our staff. &nbsp; We look forward to serving you again &nbsp;"},{"Date":"19-Jan-2018","Name":"&nbsp;Saurabh Singh &nbsp;","Content":"Great experience at store, keep it up . Hospitable employee and&nbsp;nice &nbsp; collections&nbsp;&nbsp;&nbsp;.&nbsp;Good&nbsp;job&nbsp;Nishi&nbsp;keep&nbsp;it&nbsp;up &nbsp;","ID":"Ch 03 ","Response":"&nbsp; Thanks Saurabh for your review and kind words. &nbsp; We relentlessly pursue the objective to ensure that we serve every person who &nbsp; visits our showroom with compassion and patience. &nbsp; We hold&nbsp;a&nbsp;very&nbsp;wide&nbsp;range of&nbsp;hair&nbsp;pieces&nbsp;to serve every&nbsp;possible&nbsp;requirement &nbsp; and budget. &nbsp; That is our forte. &nbsp; We look&nbsp;forward&nbsp;to&nbsp;serving&nbsp;you&nbsp;again. &nbsp;"},{"Date":"18-Jan-2018","Name":"&nbsp;Monu singh &nbsp;","Content":"Good service, Paisa vashul.... &nbsp; I love it...☺☺☺ &nbsp;","ID":"Ch 02 ","Response":"&nbsp; Thanks Manu Singh for your kind words. &nbsp; Thrilled to note you loved our products and indeed our service. &nbsp; \"Paisa Vasool\" is a sweet compliment we have received. &nbsp; It has made our day :) &nbsp; Look forward to serving you again. &nbsp;"},{"Date":"01-Jan-2018","Name":" Thiagarajan R &nbsp;","Content":"Kind &amp; smiling service... &nbsp; moderate pricing.. &nbsp; Lots of varieties.. &nbsp;","ID":"Ch 01 ","Response":"&nbsp; Thank you so much for your comments. &nbsp; Your 5&nbsp;Star&nbsp;rating&nbsp;for&nbsp;us&nbsp;boasts&nbsp;the&nbsp;morale&nbsp;of&nbsp;our&nbsp;team who&nbsp;relentlessly&nbsp;works &nbsp; to ensure complete client satisfaction &nbsp;"}]