{"username":"Jyothi Id","userimage":"J","revdate":"23-Feb-2019","revstar":"5 star ","revtext":"I visited wig o mania with a lot of chaos for my hair problem and in dire need of a solution. \r\nOn the first day of my visit, i did not had a clear idea of which Patch to buy so i just tried the Patch.\r\nI revisited the store with my daughter and then i purchased a Pacth. \r\nThough Rosy taught me on how to keep and blend the Patch, i was not sure and confident on keeping the wig by myself.\r\nSo again I visited the store 3rd time,and got the consultation on blending and using the Patch properly.\r\nDuring all my 3 visits,I have observed very clearly that staff did not hesitate to warmly welcome and treat us well. Out of all these things,I must seriously appreciate a person and that is ROSY.\r\nNo matter how many times I asked her about the Patch and blending,She helped me in finding the right Patch and showed me all varied wig blending techniques.\r\nI heartily thank her for her constant cheerful service and her patience,dedication and she has that heart and zeal of helping people.she is the one who will understand the need of the customer and come up with the best solution.\r\nVery great job dear Rosy.she can turn any pathetic situation into something beautiful.\r\nshe brought that smile back. \r\nWig o mania has wide variety of products to choose from. \r\nI am very much satisfied with the product. \r\nThank you once again for your efforts in making people happy.\r\n\r\n","revreply":"Thanks so much for your kind words and appreciation. \r\nWe are honoured and humbled when our clients take out time and write such reviews from their heart. \r\nWe are reassured of our commitment to make a difference in people\\'s lives and we assure you that we will continue serving in a similar manner. \r\n\r\nYour review will certainly help others to consider an Instant Solution which we offer to our clients as against various options that offer just a dream rather than an assured solution. \r\nRosy is renowned in her efforts to ensure every client who walks through our doors is offered the best advice and patiently understands the issue and offers her best support. \r\nCustomer satisfaction is the key.\r\n\r\n"}