{"username":" Gagan Kapoor &nbsp;","userimage":"G","revdate":"25-Dec-2018","revstar":5,"revtext":"Hi this is Gagan Kapoor and let me be as frank and real as I can get....   I have had hair issues and I had tried many before&hellip;   .got so frustrated that I thought I rather shave off my head and having said that   I really looked Uber cool....   then one day I just bumped into wigomania website and started chatting   online with one unknown voice behind me....   my experience from there till I went and met that person at the studio was   remarkable bcos she only said what was right and she is none other than   Ayesha....   she said that I look cool without hair but when you have the option....   no harm trying it out....   what a makeover....   i took my loving wife who backs my decision if she thinks I m right and she said   go for it....   the results truly are phenomenal and I m flowered with praises from all   corners....   thank you Ayesha for all your support and thank you for that stylist who gave   me a picture perfect look....   before I forget I want to thank Mrs Vasundhara from visible difference who I   look up to for everything as she is one of nicest persons I have come across in   my life....   thank you wigomania...Ayesha....   my wife and Vasundhara for helping me reinvent myself.  ","revreply":"  Hi Gagan.   We are absolutely thrilled to receive your glowing appreciation and indeed   your satisfaction with our exclusive range of hair pieces.   It reassures all of us from HO level down to the Studio that we are doing things   right and more importantly following the core principals of the Brand in UK of   making a difference in people's lives.   Aysha is without doubt our &quot;Kohinoor diamond&quot; and is renowned for her   candid comments and sincere advise.   Mrs Vasundhra is truly Wig-O-Mania's closest ally and a good friend of Mr   Hasnain our CEO. We wish you the best in your newly found personality and   may you have more success.   God Bless  "}